[
    {
        "quote": "Don't be sad because sad backwards is das, and das not good.",
        "author": "Teddy Deady"
    },
    {
        "quote": "suck dick",
        "author": "InZidiuZ"
    },
    {
        "quote": "Why you haf be mad... it's only game",
        "author": "Ilya Bryzgalov"
    },
    {
        "quote": "q g eqh qe heq he qh rw bh ewh ew",
        "author": "Ralph Ranflas"
    },
    {
        "quote": "Just remember, 7 hour support calls aren't a thing anymore!",
        "author": "Sia"
    },
    {
        "quote": "If you leave your legacy behind, what will you have?",
        "author": "Sia"
    },
    {
        "quote": "Life without roleplay is a life without fun",
        "author": "Sia"
    },
    {
        "quote": "I have not failed, I've just found 10,000 ways that won't work",
        "author": "Thomas A. Edison"
    },
    {
        "quote": "It is never too late to be what you might have been",
        "author": "George Eliot"
    },
    {
        "quote": "Everything you can imagine is real",
        "author": "Pablo Picasso"
    },
    {
        "quote": "Life isn't about finding yourself. Life is about creating yourself",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "To the well-organized mind, death is but the next great adventure",
        "author": "J.K Rowling"
    },
    {
        "quote": "Do what you can, with what you have, where you are",
        "author": "Theodore Roosevelt"
    },
    {
        "quote": "Success is not final, failure is not fatal: it is the courage to continue that counts",
        "author": "Winston Churchill"
    },
    {
        "quote": "When one door of happiness closes, another opens; but often we look so long at the closed door that we do not see the one which has been opened for us",
        "author": "Helen Keller"
    },
    {
        "quote": "Stay gold, Ponyboy",
        "author": "Sia's fav quote ever."
    },
    {
        "quote": "And, when you want something, all the universe conspires in helping you to achieve it",
        "author": "Paulo Coelho"
    },
    {
        "quote": "You may say I'm a dreamer, but I'm not the only one. I hope someday you'll join us. And the world will live as one",
        "author": "John Lennon"
    },
    {
        "quote": "It’s no use going back to yesterday, because I was a different person then",
        "author": "Lewis Carroll"
    },
    {
        "quote": "What you're supposed to do when you don't like a thing is change it. If you can't change it, change the way you think about it. Don't complain",
        "author": "Maya Angelou"
    },
    {
        "quote": "A person's a person, no matter how small.",
        "author": "Dr. Seuss"
    },
    {
        "quote": "You can't live your life for other people. You've got to do what's right for you, even if it hurts some people you love",
        "author": "Nicholas Sparks"
    },
    {
        "quote": "Nothing is impossible, the word itself says 'I'm possible'!",
        "author": "Audrey Hepburn"
    },
    {
        "quote": "Do what you feel in your heart to be right – for you’ll be criticized anyway",
        "author": "Eleanor Roosevelt"
    },
    {
        "quote": "Happiness is not something ready made. It comes from your own actions",
        "author": "Dalai Lama XIV"
    },
    {
        "quote": "Never doubt that a small group of thoughtful, committed, citizens can change the world. Indeed, it is the only thing that ever has.",
        "author": "Margaret Mead"
    },
    {
        "quote": "Peace begins with a smile",
        "author": "Mother Teresa"
    },
    {
        "quote": "Whatever you are, be a good one",
        "author": "Abraham Lincoln"
    },
    {
        "quote": "Two wrongs don't make a right, but they make a good excuse.",
        "author": "Thomas Szasz"
    },
    {
        "quote": "May you live every day of your life.",
        "author": "Jonathan Swift"
    },
    {
        "quote": "Who controls the past controls the future. Who controls the present controls the past",
        "author": "George Orwell"
    }
]
