[
    {
        "quote": "Don't be sad because sad backwards is das, and das not good.",
        "author": "Teddy Deady"
    },
    {
        "quote": "suck dick",
        "author": "InZidiuZ"
    },
    {
        "quote": "Why you haf be mad... it's only game",
        "author": "Ilya Bryzgalov"
    },
    {
        "quote": "q g eqh qe heq he qh rw bh ewh ew",
        "author": "Ralph Ranflas"
    },
    {
        "quote": "Just remember, 7 hour support calls aren't a thing anymore!",
        "author": "Sia"
    },
    {
        "quote": "If you leave your legacy behind, what will you have?",
        "author": "Sia"
    },
    {
        "quote": "Life without roleplay is a life without fun",
        "author": "Sia"
    },
    {
        "quote": "I have not failed, I've just found 10,000 ways that won't work",
        "author": "Thomas A. Edison"
    },
    {
        "quote": "It is never too late to be what you might have been",
        "author": "George Eliot"
    },
    {
        "quote": "Everything you can imagine is real",
        "author": "Pablo Picasso"
    },
    {
        "quote": "Life isn't about finding yourself. Life is about creating yourself",
        "author": "George Bernard Shaw"
    },
    {
        "quote": "To the well-organized mind, death is but the next great adventure",
        "author": "J.K Rowling"
    },
    {
        "quote": "Do what you can, with what you have, where you are",
        "author": "Theodore Roosevelt"
    },
    {
        "quote": "Success is not final, failure is not fatal: it is the courage to continue that counts",
        "author": "Winston Churchill"
    },
    {
        "quote": "When one door of happiness closes, another opens; but often we look so long at the closed door that we do not see the one which has been opened for us",
        "author": "Helen Keller"
    },
    {
        "quote": "Stay gold, Ponyboy",
        "author": "Sia's fav quote ever."
    },
    {
        "quote": "And, when you want something, all the universe conspires in helping you to achieve it",
        "author": "Paulo Coelho"
    },
    {
        "quote": "You may say I'm a dreamer, but I'm not the only one. I hope someday you'll join us. And the world will live as one",
        "author": "John Lennon"
    },
    {
        "quote": "It’s no use going back to yesterday, because I was a different person then",
        "author": "Lewis Carroll"
    },
    {
        "quote": "What you're supposed to do when you don't like a thing is change it. If you can't change it, change the way you think about it. Don't complain",
        "author": "Maya Angelou"
    },
    {
        "quote": "A person's a person, no matter how small.",
        "author": "Dr. Seuss"
    },
    {
        "quote": "You can't live your life for other people. You've got to do what's right for you, even if it hurts some people you love",
        "author": "Nicholas Sparks"
    },
    {
        "quote": "Nothing is impossible, the word itself says 'I'm possible'!",
        "author": "Audrey Hepburn"
    },
    {
        "quote": "Do what you feel in your heart to be right – for you’ll be criticized anyway",
        "author": "Eleanor Roosevelt"
    },
    {
        "quote": "Happiness is not something ready made. It comes from your own actions",
        "author": "Dalai Lama XIV"
    },
    {
        "quote": "Never doubt that a small group of thoughtful, committed, citizens can change the world. Indeed, it is the only thing that ever has.",
        "author": "Margaret Mead"
    },
    {
        "quote": "Peace begins with a smile",
        "author": "Mother Teresa"
    },
    {
        "quote": "Whatever you are, be a good one",
        "author": "Abraham Lincoln"
    },
    {
        "quote": "Two wrongs don't make a right, but they make a good excuse.",
        "author": "Thomas Szasz"
    },
    {
        "quote": "May you live every day of your life.",
        "author": "Jonathan Swift"
    },
    {
        "quote": "Who controls the past controls the future. Who controls the present controls the past",
        "author": "George Orwell"
    },
    {
        "quote": "Isn't it nice to think that tomorrow is a new day with no mistakes in it yet?",
        "author": "L.M. Montgomery"
    },
    {
        "quote": "Attitude is a choice. Happiness is a choice. Optimism is a choice. Kindness is a choice. Giving is a choice. Respect is a choice. Whatever choice you make makes you. Choose wisely.",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "Pain is inevitable. Suffering is optional",
        "author": "Haruki Murakami"
    },
    {
        "quote": "Always do what you are afraid to do",
        "author": "Ralph Waldo Emerson"
    },
    {
        "quote": "Our lives begin to end the day we become silent about things that matter.",
        "author": "Martin Luther King Jr."
    },
    {
        "quote": "The mind is its own place, and in itself can make a heaven of hell, a hell of heaven",
        "author": "John Milton"
    },
    {
        "quote": "Talent hits a target no one else can hit. Genius hits a target no one else can see.",
        "author": "Arthur Schopenhauer"
    },
    {
        "quote": "It is so hard to leave—until you leave. And then it is the easiest goddamned thing in the world",
        "author": "John Green"
    },
    {
        "quote": "Fantasy is hardly an escape from reality. It's a way of understanding it",
        "author": "Lloyd Alexander"
    },
    {
        "quote": "Do not go where the path may lead, go instead where there is no path and leave a trail.",
        "author": "Ralph Waldo Emerson"
    },
    {
        "quote": "Never let your sense of morals prevent you from doing what is right",
        "author": "Isaac Asimov"
    },
    {
        "quote": "If you can't fly then run, if you can't run then walk, if you can't walk then crawl, but whatever you do you have to keep moving forward.",
        "author": "Martin Luther King Jr."
    },
    {
        "quote": "You may not control all the events that happen to you, but you can decide not to be reduced by them.",
        "author": "Maya Angelou"
    },
    {
        "quote": "I love to see a young girl go out and grab the world by the lapels. Life's a bitch. You've got to go out and kick ass.",
        "author": "Maya Angelou"
    },
    {
        "quote": "If you remember me, then I don't care if everyone else forgets",
        "author": "Haruki Murakami"
    },
    {
        "quote": "Take responsibility of your own happiness, never put it in other people’s hands",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "Be the reason someone smiles. Be the reason someone feels loved and believes in the goodness in people",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "Be mindful. Be grateful. Be positive. Be true. Be kind",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "The future belongs to those who believe in the beauty of their dreams",
        "author": "Eleanor Roosevelt"
    },
    {
        "quote": "And, in the end\nThe love you take\nis equal to the love you make",
        "author": "Paul McCartney"
    },
    {
        "quote": "Accept yourself, love yourself, and keep moving forward. If you want to fly, you have to give up what weighs you down",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "Life is too short to waste your time on people who don’t respect, appreciate, and value you",
        "author": "Roy T. Bennett"
    },
    {
        "quote": "It’s only after you’ve stepped outside your comfort zone that you begin to change, grow, and transform'- Roy T. Bennett"
    },
    {
        "quote": "But I know, somehow, that only when it is dark enough can you see the stars",
        "author": "Martin Luther King Jr."
    },
    {
        "quote": "Big brother is always watching",
        "author": "Twoot"
    },
    {
        "quote": "Fear is the path to the dark side. Fear leads to anger. Anger leads to hate. Hate leads to suffering.",
        "author":"Yoda"
    },
    {
        "quote": "Once you start down the dark path, forever will it dominate your destiny. Consume you, it will.",
        "author": "Yoda"
    },
    {
        "quote": "Always pass on what you have learned.",
        "author": "Yoda"
    },
    {
        "quote": "Patience you must have my young Padawan.",
        "author": "Yoda"
    },
    {
        "quote": "In a dark place we find ourselves, and a little more knowledge lights our way.",
        "author": "Yoda"
    },
    {
        "quote": "Death is a natural part of life. Rejoice for those around you who transform into the Force. Mourn them do not. Miss them do not. Attachment leads to jealously. The shadow of greed, that is.",
        "author": "Yoda"
    },
    {
        "quote": "Train yourself to let go of everything you fear to lose.",
        "author": "Yoda"
    },
    {
        "quote": "You will find only what you bring in.",
        "author": "Yoda"
    },
    {
        "quote": "Difficult to see. Always in motion is the future.",
        "author": "Yoda"
    },
    {
        "quote": "To answer power with power, the Jedi way this is not. In this war, a danger there is, of losing who we are.",
        "author": "Yoda"
    },
    {
        "quote": "Many of the truths that we cling to depend on our point of view.",
        "author": "Yoda"
    },
    {
        "quote": "Named must your fear be before banish it you can.",
        "author": "Yoda"
    },
    {
        "quote": "Soon will I rest, yes, forever sleep. Earned it I have. Twilight is upon me, soon night must fall.",
        "author": "Yoda"
    },
    {
        "quote": "When you look at the dark side, careful you must be. For the dark side looks back.",
        "author": "Yoda"
    },
    {
        "quote": "Smaller in number are we, but larger in mind.",
        "author": "Yoda"
    },
    {
        "quote": "Always two there are, no more, no less. A master and an apprentice.",
        "author": "Yoda"
    },
    {
        "quote": "If no mistake you have made, losing you are. A different game you should play.",
        "author": "Yoda"
    },
    {
        "quote": "Happens to every guy sometimes this does",
        "author": "Yoda"
    }
]
